In [1]:
from google.colab import drive
drive.mount('content')

Mounted at content

#                                      SQL ASSIGNMENT

In [1]:
import pandas as pd
import sqlite3
con = sqlite3.connect('Db-IMDB-Assignment.db')

1. List all the directors who directed a 'Comedy' movie in a leap year.(You need to check that the genre is 'Comedy’ and 
   year is a leap year) Your query should return director name, the movie name, and the year.

In [22]:
data = pd.read_sql_query("select * from movie ",con)
data

      index        MID          title  year  rating  num_votes
0         0  tt2388771         Mowgli  2018     6.6      21967
1         1  tt5164214  Ocean's Eight  2018     6.2     110861
2         2  tt1365519    Tomb Raider  2018     6.4     142585
3         3  tt0848228   The Avengers  2012     8.1    1137529
4         4  tt8239946        Tumbbad  2018     8.5       7483
...     ...        ...            ...   ...     ...        ...
3468   3470  tt0090611    Allah-Rakha  1986     6.2         96
3469   3471  tt0106270          Anari  1993     4.7        301
3470   3472  tt0852989  Come December  2006     5.7         57
3471   3473  tt0375882     Kala Jigar  1939     3.3        174
3472   3474  tt0375890         Kanoon  1994     3.2        103

[3473 rows x 6 columns]





2. List the names of all the actors who played in the movie 'Anand' (1971)

In [3]:
data = pd.read_sql_query("",con)
data

                 Name
0    Amitabh Bachchan
1       Rajesh Khanna
2       Sumita Sanyal
3          Ramesh Deo
4           Seema Deo
5      Asit Kumar Sen
6          Dev Kishan
7        Atam Prakash
8       Lalita Kumari
9              Savita
10     Brahm Bhardwaj
11       Gurnam Singh
12       Lalita Pawar
13        Durga Khote
14         Dara Singh
15      Johnny Walker
16          Moolchand

3. List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [4]:
data = pd.read_sql_query(" ",con)
data

                    Name
0           Rishi Kapoor
1       Amitabh Bachchan
2                 Asrani
3           Zohra Sehgal
4         Michael Rennie
...                  ...
28632       Dhruv Shetty
28633    Hayley Cleghorn
28634    Nirvasha Jithoo
28635     Kamal Maharshi
28636       Mohini Manik

[28637 rows x 1 columns]

4. List all directors who directed 10 movies or more, in descending order of the number of movies they directed. 
Return the directors' names and the number of movies each of them directed.

In [5]:
data = pd.read_sql_query("",con)
data

    min(p.rowid)                       name  mov_count
0          17943               David Dhawan         39
1           9302               Mahesh Bhatt         36
2          37029               Priyadarshan         30
3          33282            Ram Gopal Varma         30
4          14850               Vikram Bhatt         29
5          20453       Hrishikesh Mukherjee         27
6           6393                Yash Chopra         21
7          33999             Shakti Samanta         19
8          34761            Basu Chatterjee         19
9           6402               Subhash Ghai         18
10         37234          Rama Rao Tatineni         17
11         36541              Shyam Benegal         17
12         20507   Abbas Alibhai Burmawalla         17
13         33834               Raj N. Sippy         16
14         17944             Manmohan Desai         16
15         18470                     Gulzar         16
16         34862                 Raj Kanwar         15
17           935           Mahesh Manjrekar         15
18         18003          Rajkumar Santoshi         14
19         26056                 Raj Khosla         14
20         24876               Rahul Rawail         14
21         33583                Indra Kumar         14
22         17271                Vijay Anand         13
23          6428              Rakesh Roshan         13
24         32569         K. Raghavendra Rao         13
25         34788               Harry Baweja         13
26         16388                  Dev Anand         13
27          6008             Anurag Kashyap         13
28         11108   Ananth Narayan Mahadevan         13
29         34865                Umesh Mehra         12
30          5220             Satish Kaushik         12
31         12631               Rohit Shetty         12
32         34252              Prakash Mehra         12
33         11936                Prakash Jha         12
34         21247            Nagesh Kukunoor         12
35          8484          Madhur Bhandarkar         12
36         34325               Guddu Dhanoa         12
37         21052                Anil Sharma         12
38         16876               Anees Bazmee         12
39         33461               Sanjay Gupta         11
40         34073         Pramod Chakravorty         11
41         33749              Nasir Hussain         11
42         15625                 Mohit Suri         11
43          9102                Ketan Mehta         11
44         35084            Govind Nihalani         11
45         37228            Pankaj Parashar         10
46         37196        K. Muralimohana Rao         10
47         37274                 K. Bapaiah         10
48         20205            Vishal Bhardwaj         10
49          2306           Tigmanshu Dhulia         10
50         13466              Sudhir Mishra         10
51         11776                 Raj Kapoor         10
52         18718                 N. Chandra         10
53         34929                Mehul Kumar         10
54         33170                 J.P. Dutta         10
55         34014              J. Om Prakash         10
56         25983               Hansal Mehta         10
57         34437                  Bimal Roy         10

5.a. For each year, count the number of movies in that year that had only female actors.

In [6]:
data = pd.read_sql_query("", con)
data

        title    year
0        Pihu  I 2018
1  Snegithiye    2000
2   Bindhaast    1999
3  Kala Jigar    1939

5.b. Now include a small change: report for each year the percentage of movies in that year with only female actors, 
    and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 
    1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [7]:
data = pd.read_sql_query("", con)
data

     year  tot_movie  only_female  percent
0    1939          2            1       50
1  I 2018         10            1       10
2    2000         64            1        1
3    1999         66            1        1

6. Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" 
   we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if 
    it simply occurs multiple times in casts, we still count her/him only once

In [8]:
data = pd.read_sql_query("", con)
data

           title  max(a.no_of_cast)
0  Ocean's Eight                238

7. A decade is a sequence of 10 consecutive years. For example, say in your database you have movie information starting 
from 1965. Then the first decade is 1965, 1966, ..., 1974; the second one is 1967, 1968, ..., 1976 and so on. Find the decade 
D with the largest number of films and the total number of films in D.

In [9]:
data = pd.read_sql_query(" ", con)
data

  start_dacade  end_dacade  count(*)
0         2008        2017      1126

8. Find the actors that were never unemployed for more than 3 years at a stretch. (Assume that the actors remain unemployed
   between two consecutive movies).

In [10]:
data = pd.read_sql_query("", con)
data

                 actor
0      'Ganja' Karuppu
1      A. Abdul Hameed
2       A.K. Agnihotri
3          A.K. Hangal
4      A.R. Manikandan
...                ...
6363           Zubaida
6364       Zubair Khan
6365       Zubeen Garg
6366       Zul Vellani
6367       Zulfi Sayed

[6368 rows x 1 columns]

9. Find all the actors that made more movies with Yash Chopra than any other director.

In [11]:
data = pd.read_sql_query("", con)
data

                 actor  no_of_movies
0          Jagdish Raj            11
1     Manmohan Krishna            10
2             Iftekhar             9
3        Shashi Kapoor             7
4        Rakhee Gulzar             5
..                 ...           ...
111       Varun Thajur             1
112       Varun Thakur             1
113    Vicky K. Foster             1
114         Vinod Negi             1
115         Yasin Khan             1

[116 rows x 2 columns]

10. The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan 
in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film 
as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 
have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [12]:
data = pd.read_sql_query("", con)
data

             PID                    Name
0      nm2951768            Freida Pinto
1      nm4575116             Rohan Chand
2      nm0949433            Damian Young
3      nm1753302         Waris Ahluwalia
4      nm6467532   Caroline Christl Long
...          ...                     ...
25693  nm1506519            Minoo Mehtab
25694  nm2371614         Hayley Cleghorn
25695  nm2675737         Nirvasha Jithoo
25696  nm2370589          Kamal Maharshi
25697  nm1866356            Mohini Manik

[25698 rows x 2 columns]